{
    /* <div className='read-me-section mt-12 bg-gray-800 text-white p-6 rounded-lg max-w-[750px]'>
                            <h1 className='text-xl font-semibold mb-4'>
                                혁오(HYUKOH)와 선셋 롤러코스터(Sunset Rollercoaster)의 프로젝트 앨범: AAA
                            </h1>
                            <p className={`text-gray-300 ${!showMore ? 'line-clamp-3' : ''}`}>
                                혁오(HYUKOH)와 선셋 롤러코스터(Sunset Rollercoaster)의 프로젝트 앨범: AAA 혁오(오혁,
                                임현제, 임동건, 이인우, 객원 멤버 정크야드[JNKYRD])가 타이베이에서 결성된 밴드 선셋
                                롤러코스터(Kuo-Hung Tseng, Hung-Li Chen, Shao-Hsuan Wang, Tsun-Lung Lo, Hao-Ting
                                Huang)와 프로젝트 앨범 《AAA》 를 발매했다. 이번 앨범에는 2023년 5월부터 약 1년간 혁오와
                                선셋 롤러코스터가 가평, 서울, 제주 등지에서 매달 긴밀히 함께하며 공동 창작한 8곡이
                                담겼다. 두 밴드 모두 4년만에 선보이는 앨범 《AAA》는 혁오의 충만하면서도 군더더기 없는
                                연주와 오혁 고유의 음색, 온난한 타이베이 기후를 연상시키는 선셋 롤러코스터의 낭만적
                                선율과 다양한 문화권에서 사랑받는 시적인 가사 등, 각자의 장점이 서로를 만나 조화로운
                                상승을 일으킨 결과물이다. 서로에 대한 오랜 애호, 그리고 협업의 시작 각각 데뷔 10년과
                                15년을 맞으며 아시아 전역에서 사랑받아 온 뮤지션으로서 혁오와 선셋 롤러코스터의 첫
                                인연은 더 이전으로 거슬러 올라가지만, 이들의 첫 협업은 2020년 초 시작되었다. 혁오가
                                《HYUKOH 2020 WORLD TOUR》 공연으로 도쿄를 찾았던 당시, 마침 3집 앨범 준비차 도쿄에 있던
                                선셋 롤러코스터와 대화를 나누다 오혁이 선셋 롤러코스터의 〈Candlelight〉에 피처링을 하게
                                되었고, 이후 혁오의 〈Help〉를 선셋 롤러코스터가 리메이크한 것. 팬데믹으로 인해 두
                                작업은 온라인에서만 이루어졌지만 모든 과정이 물 흐르듯 편안했던 이유는 두 밴드가
                                서로에게 가지고 있었던 오랜 애호와 존중 때문이었고, 이 과정을 통해 이들은 보다 긴밀하고
                                본격적인 협업을 상상하게 되었다. 팬데믹이 종식되고 2023년 3월 선셋 롤러코스터가 공연을
                                위해 내한했을 때 다시 만난 이들은 ‘함께 만드는 음악’에 대한 모두의 바람을 재차 확인했고,
                                그로부터 1년 여의 시간 동안 이번 《AAA》 앨범 작업에 매진했다.
                            </p>
                            {showMore && (
                                <p>
                                    트랙 소개 〈Kite War〉는 가평 음악역에서 합주 셋업을 하던 중 즉흥 연주로 만들어진 첫
                                    곡이다. 곡의 대부분이 두 개 코드로만 이루어져 있으며, 전통적이고 진실한 분위기가
                                    물씬 풍긴다. 긴 공동 창작의 시작이 된 이 곡에 대해 쿠오는 잼(jam) 연주를 시작한지
                                    5분 만에 참여한 모두가 이 곡이 완성되었음을 알았다고 후술했다. 2021년 오혁이
                                    아이패드로 만든 데모에서 시작한 〈Y〉는 반복을 최소화하고 선형적으로 흐르는 전체
                                    구조, 가스펠을 연상시키는 분위기가 인상적인 곡으로, 멤버 전원이 이번 앨범에서 가장
                                    좋아하는 곡으로 꼽는다. 만다린어로 부른 〈Antenna〉는 다양한 언어를 구사하면서도
                                    직설적인 화법을 피하는 쿠오와 오혁의 시적인 가사 작법이 두드러지는 곡이다. 중국어를
                                    모르더라도 부드러운 연음 발음의 아름다움과 몽환적인 연주를 오롯이 즐길 수 있다. 이
                                    곡의 뮤직비디오(감독 Rafhoo)에는 중화권 스타 허광한(Kuang Han Hsu)과 리아 도우(Leah
                                    Dou)가 배우로 참여했다. 타이틀 〈Glue〉는 통상적이지 않은 다양한 코드들이 정교하게
                                    얽혀 완성된 멜로디와 이에 대비되는 간결하고 낭만적인 가사가 매력적인 곡이다. 이
                                    곡에서 자연에 내재된 사랑을 떠올린 DQM 감독은 캄보디아에서 자연을 테마로
                                    뮤직비디오를 제작했다. 긴 시간 서로를 휘감으며 한 몸이 된 나무가 형상화하는 사랑과
                                    경이로운 생명력이 담긴 아름다운 장면을 곡과 함께 즐길 수 있다. 〈Young Man〉은 한때
                                    젊음을 대변했던 혁오와 선셋 롤러코스터가 이제 막 맞이한 다음 시기, 혹은 그 훨씬
                                    이후를 상상하는 곡이다. 젊음 이후의 생존과 싸움, 미래에 대한 불안이 담긴 가사와
                                    대비되는 밝고 낙천적인 멜로디가 역설적 힘을 더한다. 한 명의 노인과 《AAA》 멤버
                                    전원이 출연한 SF무드의 유쾌한 뮤직비디오 연출은 바밍타이거의 〈섹시느낌 (feat. RM of
                                    BTS)〉, RM의 〈Groin〉 등 뮤직비디오로 잘 알려진 페나키(Pennacky)가 맡았다. 쿠오의
                                    데모에서 출발한 〈Do Nothing〉는 보사노바 무드의 곡으로, 그는 이 곡을 선셋
                                    롤러코스터와 혁오가 함께할 수 있는 가장 완벽한 장르로 자평한다. 보사노바는 선셋
                                    롤러코스터의 1집 제목이기도 한 데다가, 혁오 역시 《사랑으로》 앨범에 묵직하고
                                    서정적인 보사노바를 담아냈기 때문이다. 나른하고 평화로운 휴일을 연상시키는 이 곡은
                                    역설적이게도 쿠오가 중국 투어로 매우 분주하던 중에 만들어졌다. 동료 제임스
                                    포렌(James Fouren)이 〈Antenna〉 믹싱을 체크하기 위해 곡의 속도를 반으로 늦추는 것을
                                    우연히 들은 멤버들이 그 느리고 명상적인 사운드에 매료돼 이번 앨범에 포함하게 된
                                    〈Aaaannnnteeeeennnaaaaaa〉와, 가평 음악역에서 〈Young Man〉을 작업하던 당시 합주실
                                    2층에서 녹음한 날것의 버전을 트랙화 한 〈2F 年轻人〉 또한 흥미롭다. 선물같은 두 개의
                                    트랙은 음악의 시간성과 공간성을 유쾌하게 변주한 결과물이다.
                                </p>
                            )}
                            <button
                                onClick={() => setShowMore(!showMore)}
                                className='bg-white text-black px-4 py-2 rounded-md mt-4'
                            >
                                {showMore ? 'Show Less' : 'Read More'}
                            </button>
                        </div> */
}
